{
  "_meta": {
    "maxChars": {
      "fairyAddHealth": 110,
      "fairyAddNumerator": 50,
      "fairyDefeatintro": 55,
      "fairyDefeatintro2": 125,
      "fairyDefeatReply1": 135,
      "fairyDefeatReply2": 135,
      "fairyDefeatReply3": 70,
      "fairyEndStage": 85,
      "fairyFormulaStart": 65,
      "fairyGrabAsMany": 90,
      "fairyMixedHasSimplified": 55,
      "fairyMultiplyDenominator": 70,
      "fairyMultiplyNumDenom": 95,
      "fairyNewFormula": 105,
      "fairyNextTask": 110,
      "fairyOpeningDefeat": 35,
      "fairyOpeningWin": 85,
      "fairyOpeningFormula": 65,
      "fairyWins": 90,
      "fairyPrepareYourself": 20,
      "fairySimplifyMixed": 60,
      "fairySolveFormula": 90,
      "fairyStop": 25,
      "fairyWinIntro": 85,
      "fairyWinintro2": 60,
      "fairyAdvice": 80,
      "fairyBackSoSoon": 45,
      "fairyEasyMode": 85,
      "fairyOffYouGo": 45,
      "fairyAnywayGoodluck": 75,
      "fairyBewareThough": 110,
      "fairyButThereObstacle": 130,
      "fairyCountResult": 110,
      "fairyEndingBlue": 70,
      "fairyNextChamber": 115,
      "fairyRightShare": 90,
      "fairyRightTotalWeight": 85,
      "fairyThatWillLeave": 110,
      "fairyWantShare": 110,
      "fairyWantShare2": 105,
      "fairyWowAlot": 50,
      "fairyWrongShare": 130,
      "fairyWrongTotalWeight": 95,
      "fairyAfterWrongWeightShare": 115,
      "fairyCorrectThankYou": 120,
      "fairyCorrectWantShare": 140, 
      "fairyCorrectWeight": 90,
      "fairyCorrectWeightCorrectShare": 60,
      "fairyCorrectWeightWrongShare": 125,
      "fairyLetsStart": 145,
      "fairyMayIntroduce": 85,
      "fairyOpeningEndingRed": 95,
      "fairyWrongThankYou": 55,
      "fairyWrongWantShare": 180,
      "fairyWrongWeight": 85,
      "fairyWrongWeightShare1": 180,
      "fairyWrongWeightShare2": 170,
      "fairyYouMayGoNow": 45,
      "fairyYouMayHaveHeard": 165
    }
  },
  "en": {
    "fairyAddHealth": "But first, I'll give you a reward. I'll make you healthier than before. That way, you can survive longer.",
    "fairyAddNumerator": "Now, we must add the result to the numerator.",
    "fairyDefeatintro": "Ugh... That was unexpected. A mere boy defeated me.",
    "fairyDefeatintro2": "My name is Zuma, the protector of this Dungeon of Problems. I underestimated you, mortal. To think that you can defeat me…",
    "fairyDefeatReply1": "I see. Now I understand why you can defeat me. But are you sure? Let us review the equation and see if your calculation is correct.",
    "fairyDefeatReply2": "Wow, you're a lucky boy. But that’s the wrong way to do it. I'll teach you the proper way so next time you can win without guessing.",
    "fairyDefeatReply3": "Let us review the equation and see if your calculation is correct.",
    "fairyEndStage" : "Now you are ready. Just enter the door behind me and you will be set. Good luck.",
    "fairyFormulaStart" : "Get ready! I'll teach you how to solve the equation from before.",
    "fairyGrabAsMany": "You need to grab as many of bags of jewels as you can there. But beware of the goblins!",
    "fairyMixedHasSimplified": "Now we have a new fraction number, three over two.",
    "fairyMultiplyDenominator": "We do it first by multiplying the whole number to the denominator.",
    "fairyMultiplyNumDenom" : "We need to multiply numerator with numerator, and denominator with denominator like so...",
    "fairyNewFormula": "Now that we have simplified the mixed fraction, the equation is changed to three over two times a half",
    "fairyNextTask": "Now, for your next task. In the chamber ahead of you, you will find riches and wealth, as well as dangers.",
    "fairyOpeningDefeat": "Ouch. That hurts. I surrender...",
    "fairyOpeningWin": "Done already? That should teach you not to enter this dungeon without my permission.",
    "fairyOpeningFormula": "Consider the equation one and a half times a half like so...",
    "fairyPrepareYourself": "PREPARE YOURSELF!",
    "fairySimplifyMixed": "First we need to simplify the mixed number one and a half.",
    "fairySolveFormula": "Congratulations! You've solved the equation. The correct answer is three fourth...",
    "fairyStop": "STOP! WHO GOES THERE?!",
    "fairyWinIntro": "My name is Zuma, the great protector and caretaker of this Dungeon of Problems.",
    "fairyWinintro2": "I think you need some knowledge. Let me educate you...",
    "fairyAdvice": "You know, you should brush up on your math. You wouldn't survive otherwise.",
    "fairyBackSoSoon": "Back so soon? Did you miss me, perchance?,",
    "fairyEasyMode": "But anyway, I'll activate the easy mode since it's apparently too hard for you.",
    "fairyOffYouGo": "Now off you go! See you soon... Or not.",
    "fairyAnywayGoodluck": "Anyway, I'll add some again health for you. Thank you and goodluck...",
    "fairyBewareThough": "Beware though. She is not as lenient as I do. You must really know what you are doing to pass through her.",
    "fairyButThereObstacle": "But, there is one last obstacle that you must beat. You must appease my sister, Zaimee, in the last chamber after the next one.",
    "fairyCountResult": "You have acquired twelve bags of fairy jewels. Each bag weighted one third pounds. How much do you have now?",
    "fairyEndingBlue": "So, you have returned. Well done! Let’s see how much you've got.",
    "fairyNextChamber": "Now the door is open. In the next chamber, you will have another chance to get more of these precious jewels.",
    "fairyRightShare": "That is correct. You are smart. You know your math well enough to go past this chamber.",
    "fairyRightTotalWeight": "Way to go! You are right. The answer is indeed twelve over three or four pounds.",
    "fairyThatWillLeave": "That will leave you with eight third pounds or eight bags of jewels. You can sell them for a lot of money.",
    "fairyWantShare": "But to pass this chamber, you must give some to me. These clothes and magic power are expensive, you know?",
    "fairyWantShare2": "It's not much. I just need one third of what you have right now. So can you give it to me, please?",
    "fairyWowAlot": "Wow, that's a lot! And now they are all yours.",
    "fairyWrongShare": "That's incorrect. But since I'm an honest fairy, I'll just take my correct portion, which is four third pounds of fairy jewels.",
    "fairyWrongTotalWeight": "You haven’t learned much, have you? The correct answer is twelve pver three or four pounds.",
    "fairyAfterWrongWeightShare": "You know, you need to study your math more. There are plenty of people out there who will trick you like I did.",
    "fairyCorrectThankYou": "You should be glad that your math has helped you to finish this dungeon. Thank you for sharing your wealth with me.",
    "fairyCorrectWantShare": "Now just like Zuma, I need one third of what you have right now. That means you should give me thirty over nine pounds of fairy jewels.",
    "fairyCorrectWeight": "Amazing! That's the correct answer. I can see now why you can manage to go this far.",
    "fairyCorrectWeightCorrectShare": "Wow. Your math skill is amazing! That is indeed correct.",
    "fairyCorrectWeightWrongShare": "Thank you. You're so kind to give me more than my share. You've given me one half instead of one third of the total jewels.",
    "fairyLetsStart": "Okay then, let's start. You now have twenty bags of fairy jewels. Like before, each weighted one third pounds. So how much do you have now?",
    "fairyMayIntroduce": "May I Introduce myself? I am Zaimee, the Gatekeeper of The Dungeon of Problems.",
    "fairyOpeningEndingRed": "Greetings. So, you're the one that was panting and sweating as you run through my corridors?",
    "fairyWrongThankYou": "Nevertheless, thank you! Thank you for being wrong.",
    "fairyWrongWantShare": "Right, like before, you need to give me some of them before I'll let you pass. I need one third of what you have right now. So, that should be twenty over three pounds, right?",
    "fairyWrongWeight": "Umm... Yes, thank you. That is indeed the total weight of what you have right now.",
    "fairyWrongWeightShare1": "Hahaha, you're wrong. In fact, you are wrong since the beginning. The total weight of the bags should be twenty over three pounds. So, you are actually giving me all of them.",
    "fairyWrongWeightShare2": "Hahaha, you're wrong. In fact, you are wrong since the beginning. The total weight of the bags should be twenty over three pounds. And you have given me half of it.",
    "fairyYouMayGoNow": "The door has been opened. You may go now.",
    "fairyYouMayHaveHeard": "You may have heard of me from my sister, Zuma. Unlike her, I'm not kind enough to guide you along your way. I just need you to pass my test with your own strength."
  }
}
